Repository: K19/K19-Arquivos
Catalog: hibernate-release-4.2.8.Final/project/documentation/src/main/docbook/manual/*/content/tutorial.po
Languages: fr_fr

source: Tutorial
fr_fr: Tutoriel

source: Intended for new users, this chapter provides an step-by-step introduction to Hibernate, starting with a simple application using an in-memory database. The tutorial is based on an earlier tutorial developed by Michael Gloegl. All code is contained in the <filename>tutorials/web</filename> directory of the project source.
fr_fr: A l'intention des nouveaux utilisateurs, ce chapitre fournit une introduction étape par étape à Hibernate, en commençant par une application simple, avec une base de données en-mémoire. Le tutoriel est basé sur une tutoriel antérieur qui avait été développé par Michael Gloegl. Tout le code est contenu dans <filename>tutorials/web</filename> qui se trouve dans le répertoire source du projet.

source: This tutorial expects the user have knowledge of both Java and SQL. If you have a limited knowledge of JAVA or SQL, it is advised that you start with a good introduction to that technology prior to attempting to learn Hibernate.
fr_fr: Ce tutoriel assume que l'utilisateur est déjà familier avec Java et SQL à la fois. Si vous ne possédez qu'une connaissance de Java et d'SQL limitée, il est conseillé de commencer par vous familiariser avec ces technologies avant d'aborder Hibernate.

source: The distribution contains another example application under the <filename>tutorial/eg</filename> project source directory.
fr_fr: La distribution contient un autre exemple d'application qui se trouve dans le répertoire source du projet <filename>tutorial/eg</filename>.

source: Part 1 - The first Hibernate Application
fr_fr: Section 1 - Première application Hibernate

source: For this example, we will set up a small database application that can store events we want to attend and information about the host(s) of these events.
fr_fr: Supposons que nous ayons besoin d'une petite application de base de données qui puisse stocker des événements que nous voulons suivre, et des informations à propos des hôtes de ces événements.

source: Although you can use whatever database you feel comfortable using, we will use <ulink url="http://hsqldb.org/">HSQLDB</ulink> (an in-memory, Java database) to avoid describing installation/setup of any particular database servers.
fr_fr: Malgré que vous puissiez utiliser tout base de données qui vous convienne, on choisira <ulink url="http://hsqldb.org/">HSQLDB</ulink> (une base de données Java, en-mémoire) pour éviter de décrire l'installation et la configuration de n'importe quel serveur de base de données particulière.

source: Setup
fr_fr: Configuration

source: The first thing we need to do is to set up the development environment. We will be using the "standard layout" advocated by alot of build tools such as <ulink url="http://maven.org">Maven</ulink>. Maven, in particular, has a good resource describing this <ulink url="http://maven.apache.org/guides/introduction/introduction-to-the-standard-directory-layout.html">layout</ulink>. As this tutorial is to be a web application, we will be creating and making use of <filename>src/main/java</filename>, <filename>src/main/resources</filename> and <filename>src/main/webapp</filename> directories.
fr_fr: La première chose que nous devons faire est de configurer l'environnement de développement. Nous utiliserons la "standard layout" préconisée par de nombreux outils de génération tels que <ulink url="http://maven.org">Maven</ulink>. Maven, en particulier, a une bonne ressource décrivant cette <ulink url="http://maven.apache.org/guides/introduction/introduction-to-the-standard-directory-layout.html">layout</ulink>. Comme ce tutoriel va devenir une application web, nous allons créer et utiliser les répertoires <filename>src/main/java.</filename>, <filename>src/main/ressources</filename> et <filename>src/main/webapp</filename>.

source: We will be using Maven in this tutorial, taking advantage of its transitive dependency management capabilities as well as the ability of many IDEs to automatically set up a project for us based on the maven descriptor.
fr_fr: Nous utiliserons Maven dans ce tutoriel. Nous profiterons de ses capacités de gestion de dépendances transitives, ainsi que de la capacité des nombreux IDE à installer automatiquement un projet sur la base du descripteur Maven.

source: Save this file as <filename>pom.xml</filename> in the project root directory.
fr_fr: Sauvegardez ce fichier sous la forme <filename>pom.xml</filename> dans le répertoire root du projet.

source: The first class
fr_fr: La première classe

source: Next, we create a class that represents the event we want to store in the database; it is a simple JavaBean class with some properties:
fr_fr: Ensuite, nous créons une classe qui représente l'évènement que nous voulons stocker dans notre base de données. Il s'agit d'une simple classe JavaBean avec quelques propriétés :

source: This class uses standard JavaBean naming conventions for property getter and setter methods, as well as private visibility for the fields. Although this is the recommended design, it is not required. Hibernate can also access fields directly, the benefit of accessor methods is robustness for refactoring.
fr_fr: Vous constaterez que cette classe utilise les conventions de nommage standard JavaBean pour les méthodes getter/setter des propriétés, ainsi qu'une visibilité privée pour les champs. Ceci est la conception recommandée - mais pas obligatoire. Hibernate peut aussi accéder aux champs directement, le bénéfice des méthodes d'accès est la robustesse pour la refonte de code.

source: The <literal>id</literal> property holds a unique identifier value for a particular event. All persistent entity classes (there are less important dependent classes as well) will need such an identifier property if we want to use the full feature set of Hibernate. In fact, most applications, especially web applications, need to distinguish objects by identifier, so you should consider this a feature rather than a limitation. However, we usually do not manipulate the identity of an object, hence the setter method should be private. Only Hibernate will assign identifiers when an object is saved. Hibernate can access public, private, and protected accessor methods, as well as public, private and protected fields directly. The choice is up to you and you can match it to fit your application design.
fr_fr: La propriété <literal>id</literal> contient la valeur d'un identifiant unique pour un événement particulier. Toutes les classes d'entités persistantes (il y a également des classes dépendantes de moindre importance) auront besoin d'une telle propriété identifiante si nous voulons utiliser l'ensemble complet des fonctionnalités de Hibernate. En fait, la plupart des applications (surtout les applications web) ont besoin de distinguer des objets par des identifiants, par conséquent considérez cela comme une fonctionnalité et non comme une limitation. Cependant, nous ne manipulons généralement pas l'identité d'un objet, dorénavant la méthode setter devrait être privée. Seul Hibernate assignera les identifiants lorsqu'un objet est sauvegardé. Remarquez que Hibernate peut accéder aux méthodes publiques, privées et protégées, ainsi qu'aux champs (publics, privés, protégés) directement. À vous de choisir, et vous pouvez également l'ajuster à la conception de votre application.

source: The no-argument constructor is a requirement for all persistent classes; Hibernate has to create objects for you, using Java Reflection. The constructor can be private, however package or public visibility is required for runtime proxy generation and efficient data retrieval without bytecode instrumentation.
fr_fr: Le constructeur sans argument est requis pour toutes les classes persistantes; Hibernate doit créer des objets pour vous en utilisant la réflexion Java. Le constructeur peut être privé, cependant, la visibilité du paquet est requise pour la génération de proxies à l'exécution et une récupération efficace des données sans instrumentation du bytecode.

source: Save this file to the <filename>src/main/java/org/hibernate/tutorial/domain</filename> directory.
fr_fr: Sauvegardez ce fichier dans le répertoire <filename>src/main/java/org/hibernate/tutorial/domain</filename>.

source: The mapping file
fr_fr: Le fichier de mappage

source: Hibernate needs to know how to load and store objects of the persistent class. This is where the Hibernate mapping file comes into play. The mapping file tells Hibernate what table in the database it has to access, and what columns in that table it should use.
fr_fr: Hibernate a besoin de savoir comment charger et stocker des objets d'une classe persistante. C'est là qu'intervient le fichier de mappage Hibernate. Le fichier de mappage indique à Hibernate à quelle table accéder dans la base de données, et les colonnes de cette table à utiliser.

source: The basic structure of a mapping file looks like this:
fr_fr: La structure basique de ce fichier de mappage ressemble à ce qui suit :

source: Hibernate DTD is sophisticated. You can use it for auto-completion of XML mapping elements and attributes in your editor or IDE. Opening up the DTD file in your text editor is the easiest way to get an overview of all elements and attributes, and to view the defaults, as well as some comments. Hibernate will not load the DTD file from the web, but first look it up from the classpath of the application. The DTD file is included in <filename>hibernate-core.jar</filename> (it is also included in the <filename>hibernate3.jar</filename>, if using the distribution bundle).
fr_fr: Notez que la DTD Hibernate est très sophistiquée. Vous pouvez l'utiliser pour l'auto-finalisation des éléments et des attributs de mappage XML dans votre éditeur ou votre IDE. Ouvrez également le fichier DTD dans votre éditeur de texte - c'est le moyen le plus facile d'obtenir une vue d'ensemble de tous les éléments et attributs, et de voir les valeurs par défaut, ainsi que quelques commentaires. Notez qu'Hibernate ne chargera pas le fichier DTD à partir du web, mais regardera d'abord dans le chemin de classe de l'application. Le fichier DTD est inclus dans <filename>hibernate-core.jar ainsi que </filename>dans le répertoire <filename>src</filename> de la distribution Hibernate).

source: We will omit the DTD declaration in future examples to shorten the code. It is, of course, not optional.
fr_fr: Nous omettrons la déclaration de la DTD dans les exemples futurs pour raccourcir le code. Évidemment il n'est pas optionnel.

source: Between the two <literal>hibernate-mapping</literal> tags, include a <literal>class</literal> element. All persistent entity classes (again, there might be dependent classes later on, which are not first-class entities) need a mapping to a table in the SQL database:
fr_fr: Entre les deux balises <literal>hibernate-mapping</literal>, incluez un élément <literal>class</literal>. Toutes les classes d'entités persistantes (encore une fois, il pourrait y avoir des classes dépendantes plus tard, qui ne sont pas des entités mère) ont besoin d'un mappage vers une table de la base de données SQL :

source: So far we have told Hibernate how to persist and load object of class <literal>Event</literal> to the table <literal>EVENTS</literal>. Each instance is now represented by a row in that table. Now we can continue by mapping the unique identifier property to the tables primary key. As we do not want to care about handling this identifier, we configure Hibernate's identifier generation strategy for a surrogate primary key column:
fr_fr: Plus loin, nous indiquons à Hibernate comment persister et charger un objet de la classe <literal>Event</literal> dans la table <literal>EVENTS</literal>, chaque instance étant représentée par une ligne dans cette table. Maintenant nous continuons avec le mappage de la propriété de l'identifiant unique vers la clef primaire des tables. De plus, comme nous ne voulons pas nous occuper de la gestion de cet identifiant, nous utilisons une stratégie de génération d'identifiant Hibernate pour la colonne de la clé primaire subrogée :

source: The <literal>id</literal> element is the declaration of the identifier property. The <literal>name="id"</literal> mapping attribute declares the name of the JavaBean property and tells Hibernate to use the <literal>getId()</literal> and <literal>setId()</literal> methods to access the property. The column attribute tells Hibernate which column of the <literal>EVENTS</literal> table holds the primary key value.
fr_fr: L'élément <literal>ID</literal> est la déclaration de l'identifiant de propriété. L'attribut de mappage <literal>name="id"</literal> déclare le nom de la propriété JavaBean et indique à Hibernate d'utiliser les méthodes <literal>getId()</literal> et <literal>setId()</literal> pour accéder à la propriété. L'attribut de colonne indique à Hibernate quelle colonne de la table <literal>EVENTS</literal> contient la valeur de clé primaire.

source: The nested <literal>generator</literal> element specifies the identifier generation strategy (aka how are identifier values generated?). In this case we choose <literal>native</literal>, which offers a level of portability depending on the configured database dialect. Hibernate supports database generated, globally unique, as well as application assigned, identifiers. Identifier value generation is also one of Hibernate's many extension points and you can plugin in your own strategy.
fr_fr: L'élément imbriqué <literal>Générateur</literal> spécifie la stratégie de génération d'identifiant (c'est à dire comment les valeurs d'identifiant sont-elles générées?). Dans ce cas nous avons choisi <literal>native</literal>, qui offre un niveau de la portabilité selon le dialecte de base de données configurée. Mise en veille prolongée prend en charge la base de données générée, unique au monde, ainsi que l'application affectée, les identifiants. Génération de valeur d'identifiant est aussi l'un des nombreux points d'extension d'Hibernate et vous pouvez plug-in votre propre stratégie.

source: Lastly, we need to tell Hibernate about the remaining entity class properties. By default, no properties of the class are considered persistent:
fr_fr: Enfin, nous incluons des déclarations pour les propriétés persistantes de la classe dans le fichier de mappage. Par défaut, aucune propriété de la classe n'est considérée comme persistante :

source: Similar to the <literal>id</literal> element, the <literal>name</literal> attribute of the <literal>property</literal> element tells Hibernate which getter and setter methods to use. In this case, Hibernate will search for <literal>getDate()</literal>, <literal>setDate()</literal>, <literal>getTitle()</literal> and <literal>setTitle()</literal> methods.
fr_fr: Comme avec l'élément <literal>id</literal>, l'attribut <literal>name</literal> de l'élément <literal>property</literal> indique à Hibernate quelles méthodes getters/setters utiliser. Par conséquent dans ce cas, Hibernate cherchera <literal>getDate()/setDate()</literal>, de même que <literal>getTitle()/setTitle()</literal>.

source: Why does the <literal>date</literal> property mapping include the <literal>column</literal> attribute, but the <literal>title</literal> does not? Without the <literal>column</literal> attribute, Hibernate by default uses the property name as the column name. This works for <literal>title</literal>, however, <literal>date</literal> is a reserved keyword in most databases so you will need to map it to a different name.
fr_fr: Pourquoi le mappage de la propriété <literal>date</literal> inclut-il l'attribut <literal>column</literal>, mais non le <literal>title</literal> ? Sans l'attribut <literal>column</literal>, Hibernate utilise par défaut le nom de la propriété comme nom de colonne. Cela fonctionne bien pour <literal>title</literal>. Cependant, <literal>date</literal> est un mot clé réservé dans la plupart des bases de données, donc nous utilisons un nom différent pour le mappage.

source: The <literal>title</literal> mapping also lacks a <literal>type</literal> attribute. The types declared and used in the mapping files are not Java data types; they are not SQL database types either. These types are called <emphasis>Hibernate mapping types</emphasis>, converters which can translate from Java to SQL data types and vice versa. Again, Hibernate will try to determine the correct conversion and mapping type itself if the <literal>type</literal> attribute is not present in the mapping. In some cases this automatic detection using Reflection on the Java class might not have the default you expect or need. This is the case with the <literal>date</literal> property. Hibernate cannot know if the property, which is of <literal>java.util.Date</literal>, should map to a SQL <literal>date</literal>, <literal>timestamp</literal>, or <literal>time</literal> column. Full date and time information is preserved by mapping the property with a <literal>timestamp</literal> converter.
fr_fr: Il est intéressant de noter que le mappage de <literal>title</literal> manque également d'un attribut <literal>type</literal>. Les types que nous déclarons et utilisons dans les fichiers de mappage ne sont pas, comme vous pourriez vous y attendre, des types de données Java. Ce ne sont pas, non plus, des types de base de données SQL. Ces types sont donc appelés <emphasis>types de mappage Hibernate</emphasis>, des convertisseurs qui peuvent traduire des types Java en types SQL et vice versa. De plus, Hibernate tentera de déterminer la bonne conversion et le type de mappage lui-même si l'attribut <literal>type</literal> n'est pas présent dans le mappage. Dans certains cas, cette détection automatique (utilisant la réflexion sur la classe Java) pourrait ne pas donner la valeur attendue ou dont vous avez besoin. C'est le cas avec la propriété <literal>date</literal>. Hibernate ne peut pas savoir si la propriété "mappera" une colonne SQL de type <literal>date</literal>, <literal>timestamp</literal> ou <literal>time</literal>. Nous déclarons que nous voulons conserver des informations avec une date complète et l'heure en mappant la propriété avec un convertisseur <literal>timestamp</literal>.

source: Hibernate makes this mapping type determination using reflection when the mapping files are processed. This can take time and resources, so if startup performance is important you should consider explicitly defining the type to use.
fr_fr: Hibernate rend cette détermination de type de mappage en utilisant la réflection au moment du traitement des fichiers de mappage. Cela prend du temps et consomme des ressources, donc, si la performance de démarrage est importante, vous devriez considérer définir explicitement quel type utiliser.

source: Save this mapping file as <filename>src/main/resources/org/hibernate/tutorial/domain/Event.hbm.xml</filename>.
fr_fr: Sauvegardez ce fichier de mappage ainsi <filename>src/main/resources/org/hibernate/tutorial/domain/Event.hbm.xml</filename>.

source: Hibernate configuration
fr_fr: Configuration d'Hibernate

source: At this point, you should have the persistent class and its mapping file in place. It is now time to configure Hibernate. First let's set up HSQLDB to run in "server mode"
fr_fr: A ce niveau là, vous devriez avoir la classe persistante et son fichier de mappage en place. Il est temps maintenant de configurer Hibernate. Tout d'abord, il nous faut configurer HSQLDB pour qu'il puisse exécuter en "server mode"

source: We will utilize the Maven exec plugin to launch the HSQLDB server by running: <command> mvn exec:java -Dexec.mainClass="org.hsqldb.Server" -Dexec.args="-database.0 file:target/data/tutorial"</command> You will see it start up and bind to a TCP/IP socket; this is where our application will connect later. If you want to start with a fresh database during this tutorial, shutdown HSQLDB, delete all files in the <filename>target/data</filename> directory, and start HSQLDB again.
fr_fr: Vous utiliserez le lugin exec Maven pour lancer le serveur HSQLDB en exécutant : <command> mvn exec:java -Dexec.mainClass="org.hsqldb.Server" -Dexec.args="-database.0 file:target/data/tutorial"</command>. Vous observez qu'elle démarre et ouvre un socket TCP/IP, c'est là que notre application se connectera plus tard. Si vous souhaitez démarrez à partir d'une nouvelle base de données pour ce tutoriel (choisissez <literal>CTRL + C</literal> dans la fenêtre), effacez tous les fichiers dans le répertoire <filename>target/data</filename> et redémarrez HSQL DB.

source: Hibernate will be connecting to the database on behalf of your application, so it needs to know how to obtain connections. For this tutorial we will be using a standalone connection pool (as opposed to a <interfacename>javax.sql.DataSource</interfacename>). Hibernate comes with support for two third-party open source JDBC connection pools: <ulink url="https://sourceforge.net/projects/c3p0">c3p0</ulink> and <ulink url="http://proxool.sourceforge.net/">proxool</ulink>. However, we will be using the Hibernate built-in connection pool for this tutorial.
fr_fr: Hibernate se connectera à la base de données pour le compte de votre application, donc il devra savoir comment obtenir des connexions. Pour ce tutoriel, nous devrons utliser un pool de connexions autonomes (et non pas <interfacename>javax.sql.DataSource</interfacename>). Hibernate bénéficie du support de deux pools de connexions JDBC open source de tierce partie : <ulink url="https://sourceforge.net/projects/c3p0">c3p0</ulink> and <ulink url="http://proxool.sourceforge.net/">proxool</ulink>. Cependant, nous utiliserons le pool de connexions intégré Hibernate pour ce tutoriel.

source: For Hibernate's configuration, we can use a simple <literal>hibernate.properties</literal> file, a more sophisticated <literal>hibernate.cfg.xml</literal> file, or even complete programmatic setup. Most users prefer the XML configuration file:
fr_fr: Pour la configuration de Hibernate, nous pouvons utiliser un simple fichier <literal>hibernate.properties</literal>, un fichier <literal>hibernate.cfg.xml</literal> légèrement plus sophistiqué, ou même une configuration complète par programmation. La plupart des utilisateurs préfèrent le fichier de configuration XML :

source: Notice that this configuration file specifies a different DTD
fr_fr: Vous pourrez remarquer que cette configuration XML utilise une DTD différente.

source: You configure Hibernate's <literal>SessionFactory</literal>. SessionFactory is a global factory responsible for a particular database. If you have several databases, for easier startup you should use several <literal>&lt;session-factory&gt;</literal> configurations in several configuration files.
fr_fr: Nous configurons une <literal>SessionFactory</literal> de Hibernate - une fabrique globale responsable d'une base de données particulière. Si vous avez plusieurs base de données, utilisez plusieurs configurations <literal>&lt;session-factory&gt;</literal>, généralement dans des fichiers de configuration différents (pour un démarrage plus facile).

source: The first four <literal>property</literal> elements contain the necessary configuration for the JDBC connection. The dialect <literal>property</literal> element specifies the particular SQL variant Hibernate generates.
fr_fr: Les quatre premiers éléments <literal>property</literal> contiennent la configuration nécessaire pour la connexion JDBC. L'élément <literal>property</literal> du dialecte spécifie quelle variante du SQL Hibernate va générer.
