Repository: K19/K19-Arquivos
Catalog: hibernate-release-4.2.8.Final/project/documentation/src/main/docbook/manual/*/content/tutorial.po
Languages: fr_fr

source: Hibernate's automatic session management for persistence contexts is particularly useful in this context. The <literal>hbm2ddl.auto</literal> option turns on automatic generation of database schemas directly into the database. This can also be turned off by removing the configuration option, or redirected to a file with the help of the <literal>SchemaExport</literal> Ant task. Finally, add the mapping file(s) for persistent classes to the configuration.
fr_fr: La gestion automatique des sessions d'Hibernate pour les contextes de persistance est bien pratique, comme vous pourrez le constater. L'option <literal>hbm2ddl.auto</literal> active la génération automatique des schémas de base de données - directement dans la base de données. Cela peut également être désactivé (en supprimant l'option de configuration) ou redirigé vers un fichier avec l'aide de la tâche Ant <literal>SchemaExport</literal>. Finalement, nous ajoutons le(s) fichier(s) de mappage pour les classes persistantes.

source: Save this file as <filename>hibernate.cfg.xml</filename> into the <filename>src/main/resources</filename> directory.
fr_fr: Sauvegarder ce fichier en tant que <filename>hibernate.cfg.xml</filename> dans le répertoire <filename>src/main/resources</filename>.

source: Building with Maven
fr_fr: Construction avec Maven

source: We will now build the tutorial with Maven. You will need to have Maven installed; it is available from the <ulink url="http://maven.apache.org/download.html">Maven download page</ulink>. Maven will read the <filename>/pom.xml</filename> file we created earlier and know how to perform some basic project tasks. First, lets run the <literal>compile</literal> goal to make sure we can compile everything so far:
fr_fr: Nous allons maintenant construire le tutoriel avec Maven. Vous aurez besoin d'installer Maven pour cela. Il est disponible dans la page <ulink url="http://maven.apache.org/download.html">Maven download page</ulink>. Maven pourra lire le fichier <filename>/pom.xml</filename> que nous avons créé plus tôt et saura comment effectuer quelques tâches du projet de base. Tout d'abord, exécutons <literal>compile</literal> pour s'assurer que nous pouvons tout compiler jusqu'à maintenant :

source: Startup and helpers
fr_fr: Démarrage et aides

source: It is time to load and store some <literal>Event</literal> objects, but first you have to complete the setup with some infrastructure code. You have to startup Hibernate by building a global <interfacename>org.hibernate.SessionFactory</interfacename> object and storing it somewhere for easy access in application code. A <interfacename>org.hibernate.SessionFactory</interfacename> is used to obtain <interfacename>org.hibernate.Session</interfacename> instances. A <interfacename>org.hibernate.Session</interfacename> represents a single-threaded unit of work. The <interfacename>org.hibernate.SessionFactory</interfacename> is a thread-safe global object that is instantiated once.
fr_fr: Il est temps de charger et de stocker quelques objets <literal>Event</literal>, mais d'abord nous devons compléter la configuration avec du code d'infrastructure. Nous devons démarrer Hibernate. Ce démarrage inclut la construction d'un objet <literal>SessionFactory</literal> global et le stocker dans un lieu facile d'accès dans le code de l'application. Une <literal>SessionFactory</literal> peut ouvrir de nouvelles <literal>Session</literal>s. Une <literal>Session</literal> représente une unité de travail simplement "threadée". La <interfacename>org.hibernate.SessionFactory</interfacename> est un objet global "thread-safe", instancié une seule fois.

source: We will create a <literal>HibernateUtil</literal> helper class that takes care of startup and makes accessing the <interfacename>org.hibernate.SessionFactory</interfacename> more convenient.
fr_fr: Nous créerons une classe d'aide <literal>HibernateUtil</literal> qui s'occupe du démarrage et rend la gestion des <interfacename>org.hibernate.SessionFactory</interfacename> plus facile.

source: Save this code as <filename>src/main/java/org/hibernate/tutorial/util/HibernateUtil.java</filename>
fr_fr: Sauvegardez ce code en tant que <filename>src/main/java/org/hibernate/tutorial/util/HibernateUtil.java</filename>

source: This class not only produces the global <interfacename>org.hibernate.SessionFactory</interfacename> reference in its static initializer; it also hides the fact that it uses a static singleton. We might just as well have looked up the <interfacename>org.hibernate.SessionFactory</interfacename> reference from JNDI in an application server or any other location for that matter.
fr_fr: Cette classe ne produit pas seulement la <interfacename>org.hibernate.SessionFactory</interfacename> globale dans un initialiseur statique. Elle masque le fait qu'elle exploite un singleton statique. Nous aurions pu aussi bien vérouiller la référence <interfacename>org.hibernate.SessionFactory</interfacename> à partir de JNDI dans un serveur d'application ou dans n'importe quelle location en fait. Elle pourrait aussi obtenir la <literal>SessionFactory</literal> depuis JNDI dans un serveur d'applications.

source: If you give the <interfacename>org.hibernate.SessionFactory</interfacename> a name in your configuration, Hibernate will try to bind it to JNDI under that name after it has been built. Another, better option is to use a JMX deployment and let the JMX-capable container instantiate and bind a <literal>HibernateService</literal> to JNDI. Such advanced options are discussed later.
fr_fr: Si vous nommez <interfacename>org.hibernate.SessionFactory</interfacename> dans votre fichier de configuration, Hibernate tentera la récupération depuis JNDI. Pour éviter ce code, vous pouvez aussi utiliser un déploiement JMX et laisser le conteneur (compatible JMX) instancier et lier un <literal>HibernateService</literal> à JNDI. Ces options avancées sont expliquées plus loin.

source: You now need to configure a logging system. Hibernate uses commons logging and provides two choices: Log4j and JDK 1.4 logging. Most developers prefer Log4j: copy <literal>log4j.properties</literal> from the Hibernate distribution in the <literal>etc/</literal> directory to your <literal>src</literal> directory, next to <literal>hibernate.cfg.xml</literal>. If you prefer to have more verbose output than that provided in the example configuration, you can change the settings. By default, only the Hibernate startup message is shown on stdout.
fr_fr: Nous avons finalement besoin de configurer le système de journalisation - Hibernate utilise commons-logging et vous laisse le choix entre log4j et le système de logs du JDK 1.4. La plupart des développeurs préfèrent log4j : copiez <literal>log4j.properties</literal> de la distribution de Hibernate (il est dans le répertoire <literal>etc/</literal>) dans votre répertoire <literal>src</literal>, puis faîtes de même avec <literal>hibernate.cfg.xml</literal>. Regardez la configuration d'exemple et changez les paramètres si vous voulez une sortie plus verbeuse. Par défaut, seul le message de démarrage de Hibernate est affiché sur la sortie standard.

source: The tutorial infrastructure is complete and you are now ready to do some real work with Hibernate.
fr_fr: L'infrastructure de ce toturiel est complète - et nous sommes prêts à effectuer un travail réel avec Hibernate.

source: Loading and storing objects
fr_fr: Charger et stocker des objets

source: In <literal>createAndStoreEvent()</literal> we created a new <literal>Event</literal> object and handed it over to Hibernate. At that point, Hibernate takes care of the SQL and executes an <literal>INSERT</literal> on the database.
fr_fr: Nous créons un nouvel objet <literal>Event</literal> dans <literal>createAndStoreEvent()</literal>, et nous le remettons à Hibernate, qui s'occupe maintenant du SQL et exécute les <literal>INSERT</literal> s dans la base de données.

source: What does <literal>sessionFactory.getCurrentSession()</literal> do? First, you can call it as many times and anywhere you like once you get hold of your <interfacename>org.hibernate.SessionFactory</interfacename>. The <literal>getCurrentSession()</literal> method always returns the "current" unit of work. Remember that we switched the configuration option for this mechanism to "thread" in our <filename>src/main/resources/hibernate.cfg.xml</filename>? Due to that setting, the context of a current unit of work is bound to the current Java thread that executes the application.
fr_fr: Quelle est la fonction de <literal>sessionFactory.getCurrentSession()</literal> ? Premièrement, vous pouvez l'invoquer autant de fois que vous le voulez et n'importe où, du moment que vous avez votre <literal>SessionFactory</literal> (facile grâce à <literal>HibernateUtil</literal>). La méthode <literal>getCurrentSession()</literal> renvoie toujours l'unité de travail courante. Souvenez vous que nous avons basculé notre option de configuration au mécanisme basé sur le "thread" dans <literal>hibernate.cfg.xml</literal>. Par conséquent, l'unité de travail courante est liée au thread Java courant qui exécute notre application.

source: Hibernate offers three methods of current session tracking. The "thread" based method is not intended for production use; it is merely useful for prototyping and tutorials such as this one. Current session tracking is discussed in more detail later on.
fr_fr: Hibernate offre trois méthodes le suivi de session courant. La méthode basée "thread" qui n'est pas conçue pour une utilisation de la production ; seulement utile pour les prototypes et des tutoriels comme celui-ci. Le suivi de session courant est abordé plus en détail par la suite.

source: A <interface>org.hibernate.Session</interface> begins when the first call to <literal>getCurrentSession()</literal> is made for the current thread. It is then bound by Hibernate to the current thread. When the transaction ends, either through commit or rollback, Hibernate automatically unbinds the <interface>org.hibernate.Session</interface> from the thread and closes it for you. If you call <literal>getCurrentSession()</literal> again, you get a new <interface>org.hibernate.Session</interface> and can start a new unit of work.
fr_fr: Une <interface>org.hibernate.Session</interface> commence lorsque le thread courant commence à appeler <literal>getCurrentSession()</literal>. Ensuite, elle est attachée par Hibernate au thread courant. Lorsque la transaction s'achève, par commit ou par rollback, Hibernate détache automatiquement la <literal>Session</literal> du thread et la ferme pour vous. Si vous invoquez <literal>getCurrentSession()</literal> une nouvelle fois, vous obtenez une nouvelle <literal>Session</literal> et pouvez entamer une nouvelle unité de travail.

source: Related to the unit of work scope, should the Hibernate <interface>org.hibernate.Session</interface> be used to execute one or several database operations? The above example uses one <interface>org.hibernate.Session</interface> for one operation. However this is pure coincidence; the example is just not complex enough to show any other approach. The scope of a Hibernate <interface>org.hibernate.Session</interface> is flexible but you should never design your application to use a new Hibernate <interface>org.hibernate.Session</interface> for <emphasis>every</emphasis> database operation. Even though it is used in the following examples, consider <emphasis>session-per-operation</emphasis> an anti-pattern. A real web application is shown later in the tutorial which will help illustrate this.
fr_fr: A propos de la portée de l'unité de travail, la session <interface>org.hibernate.Session</interface> Hibernate devrait-elle être utilisée pour exécuter une ou plusieurs opérations en base de données ? L'exemple ci-dessus utilise une <literal>Session</literal> pour une opération. C'est une pure coïncidence, l'exemple n'est pas assez complexe pour montrer d'autres approches. La portée d'une <literal>Session</literal> Hibernate est flexible mais vous ne devriez jamais concevoir votre application de manière à utiliser une nouvelle <literal>Session</literal> Hibernate pour <emphasis>chaque</emphasis> opération en base de données. Donc même si vous le voyez quelquefois dans les exemples suivants, considérez <emphasis>une session par opération</emphasis> comme un anti-modèle. Une véritable application (web) est affichée plus loin dans ce tutoriel.

source: To run this, we will make use of the Maven exec plugin to call our class with the necessary classpath setup: <command>mvn exec:java -Dexec.mainClass="org.hibernate.tutorial.EventManager" -Dexec.args="store"</command>
fr_fr: Pour pouvoir exécuter ceci, nous utiliserons le plugin exec Maven pour appeler notre classe avec la configuration de classpath qui convient : <command>mvn exec:java -Dexec.mainClass="org.hibernate.tutorial.EventManager" -Dexec.args="store"</command>

source: You may need to perform <command>mvn compile</command> first.
fr_fr: Vous aurez sans doute besoin d'effectuer <command>mvn compile</command> pour commencer.

source: You should see Hibernate starting up and, depending on your configuration, lots of log output. Towards the end, the following line will be displayed:
fr_fr: Vous devriez constater qu'Hibernate démarre et selon votre configuration, beaucoup de traces sur la sortie. À la fin, vous trouverez la ligne suivante :

source: This is the <literal>INSERT</literal> executed by Hibernate.
fr_fr: C'est l' <literal>INSERT</literal> exécutée par Hibernate.

source: To list stored events an option is added to the main method:
fr_fr: Maintenant nous aimerions aussi lister les événements stockés, donc nous ajoutons une option à la méthode principale :

source: A new <literal>listEvents() method is also added</literal>:
fr_fr: Nous ajoutons aussi une nouvelle méthode <literal>listEvents()</literal> :

source: Now we can call our new functionality, again using the Maven exec plugin: <command>mvn exec:java -Dexec.mainClass="org.hibernate.tutorial.EventManager" -Dexec.args="list"</command>
fr_fr: Nous pouvons maintenant appeler notre nouvelle fonctionnalité, en utilisant à nouveau le plugin exec Maven : <command>mvn exec:java -Dexec.mainClass="org.hibernate.tutorial.EventManager" -Dexec.args="list"</command>

source: Part 2 - Mapping associations
fr_fr: Section 2 - Mapper des associations

source: So far we have mapped a single persistent entity class to a table in isolation. Let's expand on that a bit and add some class associations. We will add people to the application and store a list of events in which they participate.
fr_fr: Pour l'instant, nous nous sommes contentés de mapper une classe d'une entité persistante vers une table. Profitons-en pour ajouter quelques associations de classe. D'abord nous ajouterons des gens à notre application, et stockerons une liste d'événements auxquels ils participent.

source: Mapping the Person class
fr_fr: Mapper la classe Person

source: The first cut of the <literal>Person</literal> class looks like this:
fr_fr: La première version de la classe <literal>Person</literal> est simple :

source: Save this to a file named <filename>src/main/java/org/hibernate/tutorial/domain/Person.java</filename>
fr_fr: A sauvegarder dans le fichier nommé <filename>src/main/java/org/hibernate/tutorial/domain/Person.java</filename>

source: Next, create the new mapping file as <filename>src/main/resources/org/hibernate/tutorial/domain/Person.hbm.xml</filename>
fr_fr: Puis, créez le nouveau fichier de mappage <filename>src/main/resources/org/hibernate/tutorial/domain/Person.hbm.xml</filename>

source: Finally, add the new mapping to Hibernate's configuration:
fr_fr: Finalement, ajoutez le nouveau mappage à la configuration d'Hibernate :

source: Create an association between these two entities. Persons can participate in events, and events have participants. The design questions you have to deal with are: directionality, multiplicity, and collection behavior.
fr_fr: Nous allons maintenant créer une association entre ces deux entités. Évidemment, des personnes peuvent participer aux événements, et des événements ont des participants. Les questions de conception que nous devons traiter sont : direction, cardinalité et comportement de la collection.

source: A unidirectional Set-based association
fr_fr: Une association unidirectionnelle basée sur Set

source: By adding a collection of events to the <literal>Person</literal> class, you can easily navigate to the events for a particular person, without executing an explicit query - by calling <literal>Person#getEvents</literal>. Multi-valued associations are represented in Hibernate by one of the Java Collection Framework contracts; here we choose a <interfacename>java.util.Set</interfacename> because the collection will not contain duplicate elements and the ordering is not relevant to our examples:
fr_fr: Nous allons ajouter une collection d'événements à la classe <literal>Person</literal>. De cette manière nous pouvons facilement naviguer dans les événements d'une personne particulière, sans exécuter une requête explicite - en appelant <literal>aPerson.getEvents()</literal>. Nous utilisons une collection Java, un <literal>Set</literal>, parce que la collection ne contiendra pas d'éléments dupliqués et l'ordre ne nous importe pas pour ces exemples :

source: Before mapping this association, let's consider the other side. We could just keep this unidirectional or create another collection on the <literal>Event</literal>, if we wanted to be able to navigate it from both directions. This is not necessary, from a functional perspective. You can always execute an explicit query to retrieve the participants for a particular event. This is a design choice left to you, but what is clear from this discussion is the multiplicity of the association: "many" valued on both sides is called a <emphasis>many-to-many</emphasis> association. Hence, we use Hibernate's many-to-many mapping:
fr_fr: D'abord nous mappons cette association, mais pensez à l'autre côté. Clairement, nous pouvons la laisser unidirectionnelle. Ou bien, nous pourrions créer une autre collection sur <literal>Event</literal>, si nous voulons être capable de la parcourir de manière bidirectionnelle. Ce n'est pas nécessaire d'un point de vue fonctionnel. Vous pourrez toujours exécuter une requête explicite pour récupérer les participants d'un évènement particulier. Vous êtes libre de choisir la conception, ce qui est certain, c'est que la cardinalité de l'association : "plusieurs" valués des deux côtés, est appelée <emphasis>plusieurs-à-plusieurs</emphasis>. Par conséquent nous utilisons un mappage Hibernate plusieurs-à-plusieurs :

source: Hibernate supports a broad range of collection mappings, a <literal>set</literal> being most common. For a many-to-many association, or <emphasis>n:m</emphasis> entity relationship, an association table is required. Each row in this table represents a link between a person and an event. The table name is decalred using the <literal>table</literal> attribute of the <literal>set</literal> element. The identifier column name in the association, for the person side, is defined with the <literal>key</literal> element, the column name for the event's side with the <literal>column</literal> attribute of the <literal>many-to-many</literal>. You also have to tell Hibernate the class of the objects in your collection (the class on the other side of the collection of references).
fr_fr: Hibernate supporte toutes sortes de mappage de collection, un <literal>set</literal> étant le plus commun. Pour une association plusieurs-à-plusieurs (ou une relation d'entité <emphasis>n:m</emphasis>), une table d'association est requise. Chaque ligne dans cette table représente un lien entre une personne et un événement. Le nom de la table est configuré avec l'attribut <literal>table</literal> de l'élément <literal>set</literal>. Le nom de la colonne identifiant dans l'association, du côté de la personne, est défini avec l'élément <literal>key</literal>, et le nom de la colonne pour l'événement avec l'attribut <literal>column</literal> de <literal>many-to-many</literal>. Vous devez aussi donner à Hibernate la classe des objets de votre collection (c'est-à-dire : la classe de l'autre côté de la collection).

source: The database schema for this mapping is therefore:
fr_fr: Le schéma de base de données pour ce mappage est donc :

source: Working the association
fr_fr: Travailler avec l'association

source: Now we will bring some people and events together in a new method in <literal>EventManager</literal>:
fr_fr: Réunissons quelques personnes et quelques événements dans une nouvelle méthode dans <literal>EventManager</literal> :

source: After loading a <literal>Person</literal> and an <literal>Event</literal>, simply modify the collection using the normal collection methods. There is no explicit call to <literal>update()</literal> or <literal>save()</literal>; Hibernate automatically detects that the collection has been modified and needs to be updated. This is called <emphasis>automatic dirty checking</emphasis>. You can also try it by modifying the name or the date property of any of your objects. As long as they are in <emphasis>persistent</emphasis> state, that is, bound to a particular Hibernate <interfacename>org.hibernate.Session</interfacename>, Hibernate monitors any changes and executes SQL in a write-behind fashion. The process of synchronizing the memory state with the database, usually only at the end of a unit of work, is called <emphasis>flushing</emphasis>. In our code, the unit of work ends with a commit, or rollback, of the database transaction.
fr_fr: Après le chargement d'une <literal>Person</literal> et d'un <literal>Event</literal>, modifiez simplement la collection en utilisant les méthodes normales de la collection. Comme vous pouvez le constater, il n'y a pas d'appel explicite à <literal>update()</literal> ou <literal>save()</literal>, Hibernate détecte automatiquement que la collection a été modifiée et a besoin d'être mise à jour. Ceci est appelé <emphasis>la vérification sale automatique</emphasis> (automatic dirty checking), et vous pouvez aussi l'essayer en modifiant le nom ou la propriété date de n'importe lequel de vos objets. Tant qu'ils sont dans un état <emphasis>persistant</emphasis>, c'est-à-dire, liés à une <literal>Session</literal> Hibernate particulière (c-à-d qu'ils ont juste été chargés ou sauvegardés dans une unité de travail), Hibernate surveille les changements et exécute le SQL correspondants. Le processus de synchronisation de l'état de la mémoire avec la base de données, généralement seulement à la fin d'une unité de travail, est appelé <emphasis>flushing</emphasis>. Dans notre code, l'unité de travail s'achève par un commit (ou rollback) de la transaction avec la base de données.

source: You can load person and event in different units of work. Or you can modify an object outside of a <interfacename>org.hibernate.Session</interfacename>, when it is not in persistent state (if it was persistent before, this state is called <emphasis>detached</emphasis>). You can even modify a collection when it is detached:
fr_fr: Vous pourriez bien sûr charger une personne et un événement dans différentes unités de travail. Ou vous modifiez un objet à l'extérieur d'une <literal>Session</literal>, s'il n'est pas dans un état persistant (s'il était persistant avant, nous appelons cet état <emphasis>détaché</emphasis>). Vous pouvez même modifier une collection lorsqu'elle est détachée :
