Repository: K19/K19-Arquivos
Catalog: hibernate-release-4.2.8.Final/project/documentation/src/main/docbook/manual/*/content/tutorial.po
Languages: fr_fr

source: The call to <literal>update</literal> makes a detached object persistent again by binding it to a new unit of work, so any modifications you made to it while detached can be saved to the database. This includes any modifications (additions/deletions) you made to a collection of that entity object.
fr_fr: L'appel à <literal>update</literal> rend un objet détaché à nouveau persistant, vous pourriez dire qu'il le lie à une nouvelle unité de travail, ainsi toutes les modifications que vous avez faites pendant qu'il était détaché peuvent être sauvegardées dans la base de données, cela inclut toute modification effectuées sur une collection de cet objet entité.

source: This is not much use in our example, but it is an important concept you can incorporate into your own application. Complete this exercise by adding a new action to the main method of the <literal>EventManager</literal> and call it from the command line. If you need the identifiers of a person and an event - the <literal>save()</literal> method returns it (you might have to modify some of the previous methods to return that identifier):
fr_fr: Cela n'a pas grand intérêt dans notre situation, mais c'est un concept important qu'il vous faut concevoir dans votre application. Pour le moment, complétez cet exercice en ajoutant une nouvelle action à la méthode principale de l'<literal>EventManager</literal> et invoquez-la depuis la ligne de commande. Si vous avez besoin des identifiants d'un client et d'un évènement - la méthode <literal>save()</literal> vous les retourne (vous devrez peut-être modifier certaines méthodes précédentes pour retourner ces identifiants) :

source: This is an example of an association between two equally important classes : two entities. As mentioned earlier, there are other classes and types in a typical model, usually "less important". Some you have already seen, like an <literal>int</literal> or a <classname>java.lang.String</classname>. We call these classes <emphasis>value types</emphasis>, and their instances <emphasis>depend</emphasis> on a particular entity. Instances of these types do not have their own identity, nor are they shared between entities. Two persons do not reference the same <literal>firstname</literal> object, even if they have the same first name. Value types cannot only be found in the JDK , but you can also write dependent classes yourself such as an <literal>Address</literal> or <literal>MonetaryAmount</literal> class. In fact, in a Hibernate application all JDK classes are considered value types.
fr_fr: C'était un exemple d'une association entre deux classes de même importance, deux entités. Comme mentionné plus tôt, il y a d'autres classes et d'autres types dans un modèle typique, généralement "moins importants". Vous en avez déjà vu certains, comme un <literal>int</literal> ou une <literal>String</literal>. Nous appelons ces classes des <emphasis>types de valeur</emphasis>, et leurs instances <emphasis>dépendent</emphasis> d'une entité particulière. Des instances de ces types n'ont pas leur propre identité, elles ne sont pas non plus partagées entre des entités (deux personnes ne référencent pas le même objet <literal>firstname</literal>, même si elles ont le même prénom). Bien sûr, des types de valeur n'existent pas seulement dans le JDK (en fait, dans une application Hibernate toutes les classes du JDK sont considérées comme des types de valeur), vous pouvez aussi écrire vous-même des classes dépendantes, <literal>Address</literal> ou <literal>MonetaryAmount</literal>, par exemple.

source: You can also design a collection of value types. This is conceptually different from a collection of references to other entities, but looks almost the same in Java.
fr_fr: Vous pouvez aussi concevoir une collection de types de valeur. C'est conceptuellement très différent d'une collection de références vers d'autres entités, mais très ressemblant dans Java.

source: Collection of values
fr_fr: Collection de valeurs

source: Let's add a collection of email addresses to the <literal>Person</literal> entity. This will be represented as a <interfacename>java.util.Set</interfacename> of <classname>java.lang.String</classname> instances:
fr_fr: Ajoutons un ensemble d'adresses email à l'entité <literal>Person</literal> qui sera représenté en tant que <interfacename>java.util.Set</interfacename> d'instance <classname>java.lang.String</classname> :

source: The mapping of this <literal>Set</literal> is as follows:
fr_fr: Le mappage de ce <literal>Set</literal> :

source: The difference compared with the earlier mapping is the use of the <literal>element</literal> part which tells Hibernate that the collection does not contain references to another entity, but is rather a collection whose elements are values types, here specifically of type <literal>string</literal>. The lowercase name tells you it is a Hibernate mapping type/converter. Again the <literal>table</literal> attribute of the <literal>set</literal> element determines the table name for the collection. The <literal>key</literal> element defines the foreign-key column name in the collection table. The <literal>column</literal> attribute in the <literal>element</literal> element defines the column name where the email address values will actually be stored.
fr_fr: La différence comparée au mappage vu plus tôt est la partie <literal>element</literal>, qui indique à Hibernate que la collection ne contient pas de référence vers une autre entité, mais une collection d'éléments de type <literal>String</literal> (le nom en minuscule vous indique que c'est un type/convertisseur du mappage Hibernate). Une fois encore, l'attribut <literal>table</literal> de l'élément <literal>set</literal> détermine le nom de la table pour la collection. L'élément <literal>key</literal> définit le nom de la colonne de la clé étrangère dans la table de la collection. L'attribut <literal>column</literal> dans l'élément <literal>element</literal> définit le nom de la colonne où les valeurs de <literal>String</literal> seront réellement stockées.

source: Here is the updated schema:
fr_fr: Considérons le schéma mis à jour :

source: You can see that the primary key of the collection table is in fact a composite key that uses both columns. This also implies that there cannot be duplicate email addresses per person, which is exactly the semantics we need for a set in Java.
fr_fr: Vous pouvez voir que la clé primaire de la table de la collection est en fait une clé composée, utilisant les deux colonnes. Ceci implique aussi qu'il ne peut pas y avoir d'adresses email dupliquées par personne, ce qui est exactement la sémantique dont nous avons besoin pour un ensemble dans Java.

source: You can now try to add elements to this collection, just like we did before by linking persons and events. It is the same code in Java:
fr_fr: Vous pouvez maintenant tester et ajouter des éléments à cette collection, juste comme nous l'avons fait auparavant en liant des personnes et des événements. C'est le même code dans Java.

source: This time we did not use a <emphasis>fetch</emphasis> query to initialize the collection. Monitor the SQL log and try to optimize this with an eager fetch.
fr_fr: Cette fois-ci, nous n'avons pas utilisé de requête de chargement <emphasis>fetch</emphasis> pour initialiser la collection. Traquez les logs SQL et tentez d'optimiser ce cas avec un chargement agressif.

source: Bi-directional associations
fr_fr: Associations bidirectionnelles

source: Next you will map a bi-directional association. You will make the association between person and event work from both sides in Java. The database schema does not change, so you will still have many-to-many multiplicity.
fr_fr: Ensuite nous allons mapper une association bidirectionnelle - faire fonctionner l'association entre une personne et un événement à partir des deux côtés dans Java. Bien sûr, le schéma de la base de données ne change pas, nous avons toujours une pluralité plusieurs-à-plusieurs.

source: A relational database is more flexible than a network programming language, in that it does not need a navigation direction; data can be viewed and retrieved in any possible way.
fr_fr: Une base de données relationnelle est plus flexible qu'un langage de programmation réseau, donc elle n'a pas besoin de direction de navigation - les données peuvent être vues et récupérées de toutes les manières possibles.

source: First, add a collection of participants to the <literal>Event</literal> class:
fr_fr: D'abord, ajoutez une collection de participants à la classe <literal>Event</literal> :

source: Now map this side of the association in <literal>Event.hbm.xml</literal>.
fr_fr: Maintenant mappez ce côté de l'association aussi, dans <literal>Event.hbm.xml</literal>.

source: These are normal <literal>set</literal> mappings in both mapping documents. Notice that the column names in <literal>key</literal> and <literal>many-to-many</literal> swap in both mapping documents. The most important addition here is the <literal>inverse="true"</literal> attribute in the <literal>set</literal> element of the <literal>Event</literal>'s collection mapping.
fr_fr: Comme vous le voyez, ce sont des mappages de <literal>set</literal>s normaux dans les deux documents de mappage. Notez que les noms de colonne dans <literal>key</literal> et <literal>many-to-many</literal> sont inversés dans les 2 documents de mappage. L'ajout le plus important ici est l'attribut <literal>inverse="true"</literal> dans l'élément <literal>set</literal> du mappage de la collection des <literal>Event</literal>s.

source: What this means is that Hibernate should take the other side, the <literal>Person</literal> class, when it needs to find out information about the link between the two. This will be a lot easier to understand once you see how the bi-directional link between our two entities is created.
fr_fr: Cela signifie que Hibernate devrait prendre l'autre côté - la classe <literal>Person</literal> - quand il a besoin de trouver des informations à propos du lien entre les deux. Ce sera beaucoup plus facile à comprendre une fois que vous verrez comment le lien bidirectionnel entre les deux entités est créé.

source: Working bi-directional links
fr_fr: Travailler avec des liens bidirectionnels

source: First, keep in mind that Hibernate does not affect normal Java semantics. How did we create a link between a <literal>Person</literal> and an <literal>Event</literal> in the unidirectional example? You add an instance of <literal>Event</literal> to the collection of event references, of an instance of <literal>Person</literal>. If you want to make this link bi-directional, you have to do the same on the other side by adding a <literal>Person</literal> reference to the collection in an <literal>Event</literal>. This process of "setting the link on both sides" is absolutely necessary with bi-directional links.
fr_fr: Premièrement, gardez à l'esprit qu'Hibernate n'affecte pas la sémantique normale de Java. Comment avons-nous créé un lien entre une <literal>Person</literal> et un <literal>Event</literal> dans l'exemple unidirectionnel? Nous avons ajouté une instance de <literal>Event</literal> à la collection des références d'événement d'une instance de <literal>Person</literal>. Donc, évidemment, si vous voulons rendre ce lien bidirectionnel, nous devons faire la même chose de l'autre côté, en ajoutant une référence de <literal>Person</literal> à la collection dans un <literal>Event</literal>. Cette "configuration du lien des deux côtés" est absolument nécessaire et vous ne devriez jamais oublier de le faire.

source: Many developers program defensively and create link management methods to correctly set both sides (for example, in <literal>Person</literal>):
fr_fr: Beaucoup de développeurs programment de manière défensive et créent des méthodes de gestion de lien pour affecter correctement les deux côtés, par exemple dans <literal>Person</literal> :

source: The get and set methods for the collection are now protected. This allows classes in the same package and subclasses to still access the methods, but prevents everybody else from altering the collections directly. Repeat the steps for the collection on the other side.
fr_fr: Notez que les méthodes get et set pour la collection sont maintenant protégées - ceci permet aux classes et aux sous-classes du même paquetage d'accéder aux méthodes, mais empêche quiconque de mettre le désordre directement dans les collections (enfin, presque). Vous devriez probablement faire de même avec la collection de l'autre côté.

source: What about the <literal>inverse</literal> mapping attribute? For you, and for Java, a bi-directional link is simply a matter of setting the references on both sides correctly. Hibernate, however, does not have enough information to correctly arrange SQL <literal>INSERT</literal> and <literal>UPDATE</literal> statements (to avoid constraint violations). Making one side of the association <literal>inverse</literal> tells Hibernate to consider it a <emphasis>mirror</emphasis> of the other side. That is all that is necessary for Hibernate to resolve any issues that arise when transforming a directional navigation model to a SQL database schema. The rules are straightforward: all bi-directional associations need one side as <literal>inverse</literal>. In a one-to-many association it has to be the many-side, and in many-to-many association you can select either side.
fr_fr: Et à propos de l'attribut de mappage <literal>inverse</literal> ? Pour vous, et pour Java, un lien bidirectionnel consiste simplement à configurer correctement les références des deux côtés. Hibernate n'a cependant pas assez d'informations pour ordonner correctement les expressions SQL <literal>INSERT</literal> et <literal>UPDATE</literal> (pour éviter les violations de contrainte), et a besoin d'aide pour gérer proprement les associations bidirectionnelles. Rendre <literal>inverse</literal> un côté de l'association, indique à Hibernate de l'ignorer, pour le considérer comme un <emphasis>miroir</emphasis> de l'autre côté. Cela suffit à Hibernate pour gérer tous les problèmes de transformation d'un modèle de navigation directionnelle vers un schéma SQL de base de données. Les règles dont vous devez vous souvenir sont : toutes les associations bidirectionnelles ont besoin d'un côté marqué <literal>inverse</literal>. Dans une association un-à-plusieurs ce doit être le côté plusieurs, dans une association plusieurs-à-plusieurs, vous pouvez choisir n'importe quel côté, il n'y pas de différence.

source: Part 3 - The EventManager web application
fr_fr: Section 3 - L'application web EventManager

source: A Hibernate web application uses <literal>Session</literal> and <literal>Transaction</literal> almost like a standalone application. However, some common patterns are useful. You can now write an <literal>EventManagerServlet</literal>. This servlet can list all events stored in the database, and it provides an HTML form to enter new events.
fr_fr: Une application web Hibernate utilise la <literal>Session</literal> et <literal>Transaction</literal> comme une application autonome. Cependant, quelques modèles communs sont utiles. Nous allons coder une <literal>EventManagerServlet</literal>. Ce servlet peut lister tous les évènements stockés dans la base de données, et fournir une formulaire HTML pour saisir de nouveaux évènements.

source: Writing the basic servlet
fr_fr: Écrire la servlet de base

source: First we need create our basic processing servlet. Since our servlet only handles HTTP <literal>GET</literal> requests, we will only implement the <literal>doGet()</literal> method:
fr_fr: Tout d'abord, nous devons créer notre servlet de base. La servlet n'accepte que les requêtes HTTP <literal>GET</literal>, la méthode à implémenter est donc <literal>doGet()</literal> :

source: Save this servlet as <filename>src/main/java/org/hibernate/tutorial/web/EventManagerServlet.java</filename>
fr_fr: Servir la servlet en tant que <filename>src/main/java/org/hibernate/tutorial/web/EventManagerServlet.java</filename>

source: The pattern applied here is called <emphasis>session-per-request</emphasis>. When a request hits the servlet, a new Hibernate <literal>Session</literal> is opened through the first call to <literal>getCurrentSession()</literal> on the <literal>SessionFactory</literal>. A database transaction is then started. All data access occurs inside a transaction irrespective of whether the data is read or written. Do not use the auto-commit mode in applications.
fr_fr: Le modèle appliqué ici est appelé <emphasis>session-per-request</emphasis>. Lorsqu'une requête appelle la servlet, une nouvelle <literal>Session</literal> Hibernate est ouverte à la première invocation de <literal>getCurrentSession()</literal> sur la <literal>SessionFactory</literal>. Ensuite, une transaction avec la base de données est démarrée - tous les accès à la base de données interviennent au sein de la transaction, peu importe que les données soient lues ou écrites (nous n'utilisons pas le mode auto-commit dans les applications).

source: Do <emphasis>not</emphasis> use a new Hibernate <literal>Session</literal> for every database operation. Use one Hibernate <literal>Session</literal> that is scoped to the whole request. Use <literal>getCurrentSession()</literal>, so that it is automatically bound to the current Java thread.
fr_fr: <emphasis>N'utilisez pas</emphasis> une nouvelle <literal>Session</literal> Hibernate pour chaque opération en base de données. Utilisez une <literal>Session</literal> Hibernate qui porte sur l'ensemble de la requête. Utlisez <literal>getCurrentSession()</literal>, ainsi elle est automatiquement attachée au thread Java courant.

source: Next, the possible actions of the request are processed and the response HTML is rendered. We will get to that part soon.
fr_fr: Ensuite, les actions possibles de la requêtes sont exécutées et la réponse HTML est rendue. Nous y reviendrons ultérieurement.

source: Finally, the unit of work ends when processing and rendering are complete. If any problems occurred during processing or rendering, an exception will be thrown and the database transaction rolled back. This completes the <literal>session-per-request</literal> pattern. Instead of the transaction demarcation code in every servlet, you could also write a servlet filter. See the Hibernate website and Wiki for more information about this pattern called <emphasis>Open Session in View</emphasis>. You will need it as soon as you consider rendering your view in JSP, not in a servlet.
fr_fr: Enfin, l'unité de travail s'achève lorsque l'exécution et le rendu sont achevés. Si un problème survient lors de ces deux phases, une exception est lancée et la transaction avec la base de données subit un rollback. Cela complète le modèle <literal>session-per-request</literal>. Au lieu d'avoir un code de délimitant les transactions au sein de chaque servlet, vous pouvez écrire un filtre de servlet. Voir le site Hibernate et le Wiki pour plus d'informations sur ce modèle, appelé <emphasis>Open Session in View</emphasis> - vous en aurez besoin dès que vous utiliserez des JSP et non des servlets pour le rendu de vos vues.

source: Processing and rendering
fr_fr: Traiter et interpréter

source: Now you can implement the processing of the request and the rendering of the page.
fr_fr: Implémentons l'exécution de la requête et le rendu de la page.

source: This coding style, with a mix of Java and HTML, would not scale in a more complex application&mdash;keep in mind that we are only illustrating basic Hibernate concepts in this tutorial. The code prints an HTML header and a footer. Inside this page, an HTML form for event entry and a list of all events in the database are printed. The first method is trivial and only outputs HTML:
fr_fr: Ce style de code avec une mixture de Java et d'HTML ne serait pas extensible dans une application plus complexe - gardez à l'esprit que nous ne faisons qu'illustrer les concepts basiques de Hibernate dans ce didacticiel. Ce code affiche une entête et un pied de page HTML. Dans cette page, sont affichés un formulaire pour la saisie d'évènements ainsi qu'une liste de tous les évènements de la base de données. La première méthode est triviale et ne fait que sortir de l'HTML :

source: The <literal>listEvents()</literal> method uses the Hibernate <literal>Session</literal> bound to the current thread to execute a query:
fr_fr: La méthode <literal>listEvents()</literal> utilise la <literal>Session</literal> Hibernate liée au thread courant pour exécuter la requête :

source: Finally, the <literal>store</literal> action is dispatched to the <literal>createAndStoreEvent()</literal> method, which also uses the <literal>Session</literal> of the current thread:
fr_fr: Enfin, l'action <literal>store</literal> renvoie à la méthode <literal>createAndStoreEvent()</literal>, qui utilise aussi la <literal>Session</literal> du thread courant:

source: The servlet is now complete. A request to the servlet will be processed in a single <literal>Session</literal> and <literal>Transaction</literal>. As earlier in the standalone application, Hibernate can automatically bind these objects to the current thread of execution. This gives you the freedom to layer your code and access the <literal>SessionFactory</literal> in any way you like. Usually you would use a more sophisticated design and move the data access code into data access objects (the DAO pattern). See the Hibernate Wiki for more examples.
fr_fr: La servlet est complétée. Une requête à la servlet sera exécutée par une seule <literal>Session</literal> et <literal>Transaction</literal>. Comme dans l'application autonome vue auparavant, Hibernate peut automatiquement lier ces objets au thread courant d'exécution. Cela vous laisse la liberté de séparer votre code en couches et d'accéder à la <literal>SessionFactory</literal> selon le moyen que vous aurez choisi. Généralement, vous utiliserez des conceptions plus sophistiquées et déplacerez le code d'accès aux données dans une couche DAO. Consultez le wiki Hibernate pour plus d'exemples.

source: Deploying and testing
fr_fr: Déployer et tester

source: To deploy this application for testing we must create a Web ARchive (WAR). First we must define the WAR descriptor as <filename>src/main/webapp/WEB-INF/web.xml</filename>
fr_fr: Pour déployer cette application en vue de procéder à des tests, nous devons créer un WAR (Web ARchive). Tout d'abord, nous devons définir le descripteur WAR en tant que <filename>src/main/webapp/WEB-INF/web.xml</filename>

source: To build and deploy call <literal>mvn package</literal> in your project directory and copy the <filename>hibernate-tutorial.war</filename> file into your Tomcat <filename>webapps</filename> directory.
fr_fr: Pour construire et déployer, appelez <literal>ant war</literal> dans votre projet et copiez le fichier <literal>hibernate-tutorial.war</literal> dans le répertoire <literal>webapp</literal> de Tomcat.
